UT23dev.РасширениеТорговыйЗалИКасса/src/Documents/РТЗ_РозничныйЗаказ/РТЗ_РозничныйЗаказ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РТЗ_РозничныйЗаказ</name>
  <comment>Розничный документ заказа товара</comment>
  <attributes>
    <name>Менеджер</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидЦены</name>
    <type>
      <types>CatalogRef.ВидыЦен</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Корзина</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Склад</name>
      <type>
        <types>CatalogRef.Склады</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

UT23dev.РасширениеТорговыйЗалИКасса/src/Documents/РТЗ_РозничныйЗаказ/ObjectModule.bsl
#Если Сервер Тогда

#Область ОбработчикиСобытий

Процедура ПриЗаписи(Отказ)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
КонецПроцедуры

Процедура ПередУдалением(Отказ)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти
	
#Область СлужебныеПроцедурыИФункции

// Параметры:
//  ТаблицаКорзина - ТаблицаЗначений
// Возвращаемое значение:
// - ВыборкаИзРезультатаЗапроса
Функция ЗаполнитьКолонкиЦенаИСумма(ТаблицаКорзина = Неопределено)
	Если Не ЗначениеЗаполнено(ТаблицаКорзина) Тогда
		ВызватьИсключение "Не заполнена таблица корзина";
	КонецЕсли;
	
	Если ТаблицаКорзина.Количество() = 0 Тогда
		ВызватьИсключение "Пустая корзина";
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЦеныНоменклатуры25СрезПоследних.Номенклатура,
	|	ЦеныНоменклатуры25СрезПоследних.ВидЦены,
	|	ЦеныНоменклатуры25СрезПоследних.Цена
	|ИЗ
	|	РегистрСведений.ЦеныНоменклатуры25.СрезПоследних КАК ЦеныНоменклатуры25СрезПоследних
	|ГДЕ
	|	ЦеныНоменклатуры25СрезПоследних.Номенклатура В (&Номенклатура)
	|	И ЦеныНоменклатуры25СрезПоследних.ВидЦены = &ВидЦены";
	
	ПараметрЗапросаСписокНоменклатуры = ТаблицаКорзина.ВыгрузитьКолонку("Номенклатура");
	Запрос.УстановитьПараметр("Номенклатура", ПараметрЗапросаСписокНоменклатуры);
	Запрос.УстановитьПараметр("ВидЦены", ВидЦены);
	
	
	Резульатат = Запрос.Выполнить();
	Выборка = Резульатат.Выгрузить();
	Возврат Выборка;
КонецФункции

//Функция печати табличного документа розничного заказа
//
// Возвращаемое значение:
//  - ТабличныйДокумент
//  - Неопределено
Функция ПечататьЗаказСервер() Экспорт
	Перем Сумма;
	
	Если Не Проведен Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ТабличныйДокумент = Новый ТабличныйДокумент();
	
	//Макет
	Макет = Документы.РТЗ_РозничныйЗаказ.ПолучитьМакет("Заказ");
	
	//Области
	ОбластьШапка = Макет.ПолучитьОбласть("Заказ|Шапка");
	ОбластьСтрока = Макет.ПолучитьОбласть("Заказ|Строка");
	ОбластьПодвал = Макет.ПолучитьОбласть("Заказ|Подвал");
	
	//Картинка штрихкода
	ШтрихкодПустой = ОбластьШапка.Рисунки.Штрихкод;
	РисунокШтрихкода = ПолучитьШтрихкод(ШтрихкодПустой.Ширина + ШтрихкодПустой.Ширина * 0.25, 
										ШтрихкодПустой.Высота + ШтрихкодПустой.Высота * 0.25, 4);
	
	//Область(Шапка)				
	ОбластьШапка.Рисунки.Штрихкод.Картинка = РисунокШтрихкода;
	ОбластьШапка.Параметры.НомерЗаказа = "Заказ №" + Номер;
	ТабличныйДокумент.Вывести(ОбластьШапка);
	
	//Область(Строка)
	ТаблицаДляОбхода = ЗаполнитьКолонкиЦенаИСумма(Корзина);
	Для Каждого ЭлементТаблица Из ТаблицаДляОбхода Цикл
		ТекущаяНоменклатура = ЭлементТаблица.Номенклатура;
		ОбластьСтрока.Артикул 		= ТекущаяНоменклатура.Артикул;
		ОбластьСтрока.Номенклатура 	= ТекущаяНоменклатура.Наименование;
		ОбластьСтрока.Количество 	= ЭлементТаблица.Количество;				
		ОбластьСтрока.Цена 			= ЭлементТаблица.Цена;
	КонецЦикла;
	
	//Область(Подвал)
	Если Не ТаблицаДляОбхода.Колонки.Найти("Сумма") = Неопределено Тогда	
		ОбластьПодвал.Параметры.Сумма = Строка(Сумма) + " " + "руб.";
		ТабличныйДокумент.Вывести(ОбластьПодвал);
	КонецЕсли;
	
	Наименование = "ЗаказРозничный_"+Номер;
	ТабличныйДокумент.ИспользуемоеИмяФайла = Наименование;
	ТабличныйДокумент.ИмяСохраненияПоложенияОкна = Наименование;
	ТабличныйДокумент.ТолькоПросмотр = Истина;
	ТабличныйДокумент.ОтображатьСетку = Ложь;
	ТабличныйДокумент.АвтоМасштаб = Ложь;
	Возврат ТабличныйДокумент;
КонецФункции

// Получает изображение штрихкода
// 
// Параметры:
//  ШиринаШтрихкода - Число - значение ширины штрихкода
//  ВысотаШтрихкода - Число - значение высоты штрихкода
//  ЗначШтрихкод - Строка - Входные данные
//  ЗначТипШтрихкода - Число - тип штрих кода по документации
//  
//  Возвращаемое значение:
//   - Картинка
Функция ПолучитьШтрихкод(ШиринаШтрихкода, ВысотаШтрихкода, ЗначТипШтрихкода) Экспорт
	ПараметрыШтрихкода = ГенерацияШтрихкода.ПараметрыГенерацииШтрихкода();
	ПараметрыШтрихкода.Ширина = ШиринаШтрихкода;
	ПараметрыШтрихкода.Высота = ВысотаШтрихкода;
	ПараметрыШтрихкода.ТипКода = ЗначТипШтрихкода;
	ПараметрыШтрихкода.Штрихкод = Документы.РТЗ_РозничныйЗаказ.ЗакодироватьНомер(Номер);
	ПараметрыШтрихкода.ПрозрачныйФон = Истина;
	ПараметрыШтрихкода.УровеньКоррекцииQR = 2;
	ПараметрыШтрихкода.ОтображатьТекст = Ложь;
	ПараметрыШтрихкода.Масштабировать = Истина;
	ПараметрыШтрихкода.СохранятьПропорции = Истина;
	ПараметрыШтрихкода.ВертикальноеВыравнивание  = 1;
	ПараметрыШтрихкода.GS1DatabarКоличествоСтрок = 1;
	ПараметрыШтрихкода.ТипВходныхДанных = 0;
	
	РезультатШтрихкод = ГенерацияШтрихкода.ИзображениеШтрихкода(ПараметрыШтрихкода);
	
	Возврат РезультатШтрихкод.Картинка;
КонецФункции

#КонецОбласти

#КонецЕсли
